# DiameterSymbolLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DiameterSymbolLocation Property
ParameterTypeId Class See Also
---
"Diameter Symbol Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DiameterSymbolLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DiameterSymbolLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DiameterSymbolLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace